Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateBalusterPatterns Property
 Can't create Baluster Patterns for Railings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateBalusterPatterns { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateBalusterPatterns As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateBalusterPatterns {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace